package com.example.springmybatisdemo.domain;

import lombok.Data;

import java.util.List;

/**
 * @author 12392
 */
@Data
public class BaiKeBean {

    /**
     * title : 产蛋崖
     * summary : 贵州黔南布依族苗族自治州三都县有一处奇特的地质景观——“产蛋崖”，每隔数十年就会掉落出一些与恐龙蛋外形相似的“石蛋”，当地百姓称为“石头下蛋”。 “产蛋崖”长20多米、高6米，表面极不平整，近百枚“石蛋”错落有致地镶嵌在陡崖上，直径约30-60厘米，最重的达300余公斤。“产蛋崖”成因至今尚无定论，有专家推测其形成于五亿年前，由碳酸钙分子在特定化学作用下渐渐凝聚在一起结核而成。随着亿万年的地质运动，这些“石蛋”暴露于地表，最终因风化和流水侵蚀的作用而逐渐从崖壁上脱落。
     * sections : [{"title":"调查","content":"贵州省三都县有一座登赶山，这座山特别奇怪，满山都长满了绿树杂草，而唯独山腰上裸露出一块崖壁，更奇怪的是，这块崖壁每隔三十年就会自动掉落出一些石蛋，因此当地人都习惯把它叫做产蛋崖。产蛋崖长20多米，高6米，表面极不平整，在高处，几块巨大而尖利的岩石横亘着，极为险峻。而石蛋就在相对凹进去的崖壁上安静地孕育着。有的刚刚露头，有的已经生出了一半，有的已经发育成熟，眼看就要与山体分离。\n  产蛋崖\n冰冷的石壁为何能生出石蛋?为什么这些石蛋又会每隔30年自动掉落呢?产蛋崖生石蛋的这一神秘现象，像一团迷雾一直笼罩在登赶山下这片水族之乡。 \n姑鲁寨，它是三都县典型的一个水族村寨，自从一千年前水族的\u2014个分支迁入黔南至今，有一千年了。水族人房子一样、衣着一样、生活方式都一样，而惟独姑鲁寨各家各户几乎都收藏着从产蛋崖上生出来的石蛋。 \n整个姑鲁寨虽然只有20几户人家，但迄今为止全村却一共保存着68颗石蛋。姑鲁寨的人都以家里有石蛋为荣，因为只要谁家里有石蛋，谁家就人畜兴旺、衣食无忧，所以每到晚上人们就要把它们当宝贝一样收进去。 \n听到这个消息的人都觉得很神奇，都想把这个谜底给解开，慢慢地这个事情就越传越广，很多人就慕名而来想一探究竟，可惜谁也没有搞清楚这到底是怎么回事。 \n王尚彦博士是贵州省地质矿产勘查开发局的总工程师。2005年6月他在网上浏览新闻时看到了产蛋崖上石蛋的照片，看到照片他马上就有了联想。\u201c在网上浏览了照片，发现从它的形态来看，它绝大部分都是圆形的、椭圆形的，而且颜色有一些淡黄色的，就很像恐龙蛋。\u201d王尚彦说。 \n恐龙蛋?这可是\u2014个大胆而惊人的猜测。中国是世界上恐龙蛋最多的国家，贵州省境内虽然曾经发现过一些恐龙的骨骼化石，但迄今为止从未发现过恐龙蛋化石。所以，如果这些石蛋真是恐龙蛋的话，那它将具有无可估量的科研价值和经济价值。 \n王尚彦立刻把石蛋和以前发现的恐龙蛋化石进行比较，他发现：产蛋崖的石蛋平均直径30厘米，但有大有小，这和1995年广东河源发现的恐龙蛋化石相比，不论形状和大小均十分相似；另外，恐龙蛋化石虽然有蛋壳结构，但长期风化裸露出的纹理和石蛋相比，仍然有很多相似特征。\n  产蛋崖\n既然有这么多相似点，那是否说明这些石蛋就是恐龙蛋呢?如果答案是肯定的，那么还有一个更大的疑点将无法解释\u2014\u2014贵州的地质年代属于三叠纪，而恐龙的出现要比三叠纪晚五千万年!因此恐龙蛋怎么可能会早于恐龙而在三叠纪的地层里被发现呢? \n如果不是恐龙蛋，那自动生出的石蛋究竟是什么呢? \n为了认定这些石蛋的性质，只有进行实地考察，一切才能水落石出。事不宜迟，王尚彦马上召集同伴出发，他要赶往三都县亲自到现场\u2014探究竟。一到三都县，王尚彦就即刻赶往登赶山，此时夜幕已经降临。经过一个晚上的休整，第二天，王尚彦和他的同伴们一早就爬上了产蛋崖。在这里，石蛋盗挖现象非常严重，王尚彦带来的工具马上派上了用场。虽然已经有三十年的地质工作经历，但当他如此近距离地接触这一奇观，还是抑制不住地激动。这群罕见的石蛋究竟会不会是恐龙蛋呢? \n\u201c当时我们看这个照片的时候就有一个疑问它很可能是恐龙蛋化石，但是我们在野外一看，它显然不是恐龙蛋化石。\u201d王尚彦解释说，\u201c一般恐龙蛋的形状大多是纺锤状的，并且应该有一个外壳，而这个石蛋没有外壳。作为恐龙蛋除了壳之外，里面的结构就是和鸡蛋一样有蛋清和蛋黄，那么它里面肯定是不均匀的团块团块的，而这个我们看到的岩石，显然它里面的这个结构是比较均一的。\u201d石蛋竟然不是恐龙蛋!那它又会是什么呢? \n石蛋形成于距今五亿年前的寒武纪。 \n王尚彦希望通过测定这些石蛋所形成的地质年代，来最终揭开它神秘的面纱。王尚彦不仅在产蛋崖上对所需要的岩石样本都进行采集，同时他又在三都县的周围广泛勘查了一次地质环境，并采集了周边类似的岩石样本一起带回实验室。 \n然而经过分析测定，王尚彦发现石蛋所形成的地质年代既不是侏罗纪，也不是在贵州分布最广的三叠纪，而是比这些地层更早的寒武纪，到现在已经有五亿年的历史了。王尚彦还发现产蛋崖上的石壁是由一种泥岩构成，而石蛋竟然是一种在很多地方都常见的灰岩结构。如此常见的灰岩构成的石蛋究竟又是如何跑到五亿年前的寒武纪石头里去的呢? "},{"title":"答案","content":"在五亿年前的寒武纪，贵州三都还是一片深海，当时有一些碳酸钙分子游离于深海的软泥中，在特定化学作用下它们渐渐凝聚在一起形成结核，经过上层沉积物的不断压实，软泥和结核都变成了埋藏于深海地下的岩石，软泥成了泥岩，而结核成了石蛋，经过亿万年的地质运动，它们最后就暴露于地表。 \n迷惑水族人一千年的神奇的石蛋如今看来却只是一些很普通的蛋形石头而已，然而结论果真如此吗?为什么这些石蛋会每隔30年自动孕育而出呢? \n对于这一奇特的现象，姑鲁寨的男男女女都无法给出答案。而经过对岩石特性的充分测定和实验，王尚彦最终揭开了谜底。 \n五亿年前的寒武纪，当石蛋形成并暴露于地表后。由于差异风化，泥岩构成的崖壁风化速度快，而结核形成的石蛋风化速度慢，当泥岩层层风化剥落，石蛋就慢慢孕育而出。 \n由于围岩的风化速度大约相差30年，所以每过30年左右围岩风化后石蛋在重力作用下就自动脱落滚落到山脚。这就是产蛋崖\u201c蛋\u201d的真正秘密。 \n"}]
     * tags : ["地理","自然","自然现象","旅游","景点","景区","奇观"]
     * url : http://baike.baidu.com/view/04604698.htm
     */

    private String title;
    private String summary;
    private String url;
    private List<SectionsBean> sections;
    private List<String> tags;

    public Integer count = 0;

    @Data
    public static class SectionsBean {
        /**
         * title : 调查
         * content : 贵州省三都县有一座登赶山，这座山特别奇怪，满山都长满了绿树杂草，而唯独山腰上裸露出一块崖壁，更奇怪的是，这块崖壁每隔三十年就会自动掉落出一些石蛋，因此当地人都习惯把它叫做产蛋崖。产蛋崖长20多米，高6米，表面极不平整，在高处，几块巨大而尖利的岩石横亘着，极为险峻。而石蛋就在相对凹进去的崖壁上安静地孕育着。有的刚刚露头，有的已经生出了一半，有的已经发育成熟，眼看就要与山体分离。
           产蛋崖
         冰冷的石壁为何能生出石蛋?为什么这些石蛋又会每隔30年自动掉落呢?产蛋崖生石蛋的这一神秘现象，像一团迷雾一直笼罩在登赶山下这片水族之乡。
         姑鲁寨，它是三都县典型的一个水族村寨，自从一千年前水族的—个分支迁入黔南至今，有一千年了。水族人房子一样、衣着一样、生活方式都一样，而惟独姑鲁寨各家各户几乎都收藏着从产蛋崖上生出来的石蛋。
         整个姑鲁寨虽然只有20几户人家，但迄今为止全村却一共保存着68颗石蛋。姑鲁寨的人都以家里有石蛋为荣，因为只要谁家里有石蛋，谁家就人畜兴旺、衣食无忧，所以每到晚上人们就要把它们当宝贝一样收进去。
         听到这个消息的人都觉得很神奇，都想把这个谜底给解开，慢慢地这个事情就越传越广，很多人就慕名而来想一探究竟，可惜谁也没有搞清楚这到底是怎么回事。
         王尚彦博士是贵州省地质矿产勘查开发局的总工程师。2005年6月他在网上浏览新闻时看到了产蛋崖上石蛋的照片，看到照片他马上就有了联想。“在网上浏览了照片，发现从它的形态来看，它绝大部分都是圆形的、椭圆形的，而且颜色有一些淡黄色的，就很像恐龙蛋。”王尚彦说。
         恐龙蛋?这可是—个大胆而惊人的猜测。中国是世界上恐龙蛋最多的国家，贵州省境内虽然曾经发现过一些恐龙的骨骼化石，但迄今为止从未发现过恐龙蛋化石。所以，如果这些石蛋真是恐龙蛋的话，那它将具有无可估量的科研价值和经济价值。
         王尚彦立刻把石蛋和以前发现的恐龙蛋化石进行比较，他发现：产蛋崖的石蛋平均直径30厘米，但有大有小，这和1995年广东河源发现的恐龙蛋化石相比，不论形状和大小均十分相似；另外，恐龙蛋化石虽然有蛋壳结构，但长期风化裸露出的纹理和石蛋相比，仍然有很多相似特征。
           产蛋崖
         既然有这么多相似点，那是否说明这些石蛋就是恐龙蛋呢?如果答案是肯定的，那么还有一个更大的疑点将无法解释——贵州的地质年代属于三叠纪，而恐龙的出现要比三叠纪晚五千万年!因此恐龙蛋怎么可能会早于恐龙而在三叠纪的地层里被发现呢?
         如果不是恐龙蛋，那自动生出的石蛋究竟是什么呢?
         为了认定这些石蛋的性质，只有进行实地考察，一切才能水落石出。事不宜迟，王尚彦马上召集同伴出发，他要赶往三都县亲自到现场—探究竟。一到三都县，王尚彦就即刻赶往登赶山，此时夜幕已经降临。经过一个晚上的休整，第二天，王尚彦和他的同伴们一早就爬上了产蛋崖。在这里，石蛋盗挖现象非常严重，王尚彦带来的工具马上派上了用场。虽然已经有三十年的地质工作经历，但当他如此近距离地接触这一奇观，还是抑制不住地激动。这群罕见的石蛋究竟会不会是恐龙蛋呢?
         “当时我们看这个照片的时候就有一个疑问它很可能是恐龙蛋化石，但是我们在野外一看，它显然不是恐龙蛋化石。”王尚彦解释说，“一般恐龙蛋的形状大多是纺锤状的，并且应该有一个外壳，而这个石蛋没有外壳。作为恐龙蛋除了壳之外，里面的结构就是和鸡蛋一样有蛋清和蛋黄，那么它里面肯定是不均匀的团块团块的，而这个我们看到的岩石，显然它里面的这个结构是比较均一的。”石蛋竟然不是恐龙蛋!那它又会是什么呢?
         石蛋形成于距今五亿年前的寒武纪。
         王尚彦希望通过测定这些石蛋所形成的地质年代，来最终揭开它神秘的面纱。王尚彦不仅在产蛋崖上对所需要的岩石样本都进行采集，同时他又在三都县的周围广泛勘查了一次地质环境，并采集了周边类似的岩石样本一起带回实验室。
         然而经过分析测定，王尚彦发现石蛋所形成的地质年代既不是侏罗纪，也不是在贵州分布最广的三叠纪，而是比这些地层更早的寒武纪，到现在已经有五亿年的历史了。王尚彦还发现产蛋崖上的石壁是由一种泥岩构成，而石蛋竟然是一种在很多地方都常见的灰岩结构。如此常见的灰岩构成的石蛋究竟又是如何跑到五亿年前的寒武纪石头里去的呢?
         */

        private String title;
        private String content;
    }
    public void testMethod(String arg){
//        System.out.println("Hello "+arg);
        count++;
    }
}
